ch7lin-cyber/myNXPs16_Prj/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITEXTADCPINS_CV_SEL_0_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITEXTADCPINS_CV_SEL_0_GPIO_PIN_MASK (1U << 28U) /*!<@brief GPIO pin mask */
#define BOARD_INITEXTADCPINS_CV_SEL_0_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEXTADCPINS_CV_SEL_0_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_INITEXTADCPINS_CV_SEL_0_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PIO1_12 (number 67), U5[3]/FS_USB0_PWR_EN#
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITEXTADCPINS_CV_SEL_1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITEXTADCPINS_CV_SEL_1_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */
#define BOARD_INITEXTADCPINS_CV_SEL_1_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEXTADCPINS_CV_SEL_1_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITEXTADCPINS_CV_SEL_1_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PIO1_26 (number 68), U12[11]/J12[13]/J12[17]/ACC_INT_EXP_P1_26
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITEXTADCPINS_CV_SEL_2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITEXTADCPINS_CV_SEL_2_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */
#define BOARD_INITEXTADCPINS_CV_SEL_2_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEXTADCPINS_CV_SEL_2_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITEXTADCPINS_CV_SEL_2_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PIO0_24 (number 70), J26/P0_24
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITEXTADCPINS_CV_SEL_3_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITEXTADCPINS_CV_SEL_3_GPIO_PIN_MASK (1U << 24U) /*!<@brief GPIO pin mask */
#define BOARD_INITEXTADCPINS_CV_SEL_3_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEXTADCPINS_CV_SEL_3_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITEXTADCPINS_CV_SEL_3_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*!
 * @brief Use 4 AD7124 modules; Route 7 SPI pins: MOSI(d_out), MISO(d_in), SCK(clock), SSEL0~3; Route 4 GPIO pins.
 *
 */
void BOARD_InitExtADCPins(void); /* Function assigned for the Cortex-M33 */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_0_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 3. */
#define PIO0_0_FUNC_ALT3 0x03u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_18_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 3. */
#define PIO0_18_FUNC_ALT3 0x03u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_19_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 3. */
#define PIO1_19_FUNC_ALT3 0x03u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_22_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 3. */
#define PIO1_22_FUNC_ALT3 0x03u

/*! @name CTIMER2_MAT3 (number 41), U25[3]/CAN_RXD
  @{ */
/* @} */

/*! @name CTIMER0_MAT0 (number 54), J11[2]/J13[5]/ARD_CMP0_IN_A
  @{ */
/* @} */

/*! @name CTIMER3_MAT1 (number 58), J18[4]/ISP_P1_19
  @{ */
/* @} */

/*! @name CTIMER1_MAT0 (number 56), J11[1]/J12[19]/EXP_CMP0_IN_C
  @{ */
/* @} */

/*!
 * @brief Route 4 CTIMER_MATCH(pwm) pins.
 *
 */
void BOARD_InitPULSEPins(void); /* Function assigned for the Cortex-M33 */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_27_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_27_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_7_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 3. */
#define PIO0_7_FUNC_ALT3 0x03u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_8_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 3. */
#define PIO0_8_FUNC_ALT3 0x03u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_15_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_15_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_16_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_16_FUNC_ALT0 0x00u

/*! @name PIO0_27 (number 27), J8[4]/J12[14]/ARD_MIK_FC2_USART_TXD
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITEXTDACPINS_SYNC_BAR_0_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITEXTDACPINS_SYNC_BAR_0_GPIO_PIN_MASK (1U << 27U) /*!<@brief GPIO pin mask */
#define BOARD_INITEXTDACPINS_SYNC_BAR_0_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEXTDACPINS_SYNC_BAR_0_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_INITEXTDACPINS_SYNC_BAR_0_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

