ch7lin-cyber/myNXPs16_Prj/board/pin_mux.h
/*! @name PIO1_15 (number 82), J3[4]/U6[3]/J12[11]/FS_USB0_ID
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITEXTDACPINS_SYNC_BAR_1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITEXTDACPINS_SYNC_BAR_1_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */
#define BOARD_INITEXTDACPINS_SYNC_BAR_1_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEXTDACPINS_SYNC_BAR_1_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITEXTDACPINS_SYNC_BAR_1_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO1_16 (number 87), J12[18]/J13[4]/EXP_P1_16
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITEXTDACPINS_CLR_BAR_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITEXTDACPINS_CLR_BAR_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */
#define BOARD_INITEXTDACPINS_CLR_BAR_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEXTDACPINS_CLR_BAR_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITEXTDACPINS_CLR_BAR_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*!
 * @brief Use 2 2-CH DAC modules; Route 5 pins: MOSI(data), SCK(clock), SSEL(/SYNC), GPIO0(/CLR), GPIO1(/LDAC)
 *
 */
void BOARD_InitExtDACPins(void); /* Function assigned for the Cortex-M33 */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_16_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_16_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_19_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_19_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_23_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_23_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_25_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_25_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_26_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_26_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_25_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_25_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_8_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_8_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_9_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_9_FUNC_ALT0 0x00u

/*! @name PIO1_9 (number 10), SW3/J12[2]/ARD_BTN_USR_P1_9
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDIOPINS_DI0_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDIOPINS_DI0_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */
#define BOARD_INITDIOPINS_DI0_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDIOPINS_DI0_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITDIOPINS_DI0_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO0_16 (number 14), J7[1]/J13[1]/JP4[1]/ARD_MIK_ADC0_8_N
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDIOPINS_DI1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDIOPINS_DI1_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */
#define BOARD_INITDIOPINS_DI1_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDIOPINS_DI1_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITDIOPINS_DI1_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_23 (number 20), J13[3]/JP4[3]/ARD_ADC0_0_P
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDIOPINS_DI2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDIOPINS_DI2_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */
#define BOARD_INITDIOPINS_DI2_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDIOPINS_DI2_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITDIOPINS_DI2_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO1_8 (number 24), J9[20]/ARD_P1_8
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDIOPINS_DI3_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDIOPINS_DI3_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */
#define BOARD_INITDIOPINS_DI3_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDIOPINS_DI3_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITDIOPINS_DI3_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO1_25 (number 77), J9[15]/J12[5]/I2S_IRQ
  @{ */

