ch7lin-cyber/myNXPs16_Prj/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITDIOPINS_DO3_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDIOPINS_DO3_GPIO_PIN_MASK (1U << 25U) /*!<@brief GPIO pin mask */
#define BOARD_INITDIOPINS_DO3_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDIOPINS_DO3_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_INITDIOPINS_DO3_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_25 (number 79), J27/P0_25
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDIOPINS_DO2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDIOPINS_DO2_GPIO_PIN_MASK (1U << 25U) /*!<@brief GPIO pin mask */
#define BOARD_INITDIOPINS_DO2_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDIOPINS_DO2_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_INITDIOPINS_DO2_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_19 (number 90), U13[30]/J9[11]/FC7_I2S_WS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDIOPINS_DO0_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDIOPINS_DO0_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */
#define BOARD_INITDIOPINS_DO0_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDIOPINS_DO0_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITDIOPINS_DO0_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_26 (number 60), J7[6]/J9[14]/ARD_MIK_HSSPI_MOSI
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDIOPINS_DO1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDIOPINS_DO1_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */
#define BOARD_INITDIOPINS_DO1_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDIOPINS_DO1_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITDIOPINS_DO1_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDIOPins(void); /* Function assigned for the Cortex-M33 */

/*!
 * @brief Analog switch input control.: Analog switch is closed. (enable) */
#define PIO0_15_ASW_ENABLE 0x01u
/*!
 * @brief Select Digital mode.: Disable digital mode. Digital input set to 0. */
#define PIO0_15_DIGIMODE_ANALOG 0x00u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_15_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_15_MODE_INACTIVE 0x00u
/*!
 * @brief Analog switch input control.: Analog switch is closed. (enable) */
#define PIO0_31_ASW_ENABLE 0x01u
/*!
 * @brief Select Digital mode.: Disable digital mode. Digital input set to 0. */
#define PIO0_31_DIGIMODE_ANALOG 0x00u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_31_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_31_MODE_INACTIVE 0x00u

/*!
 * @brief Route 2 ADC0 pins.
 *
 */
void BOARD_InitCJCPins(void); /* Function assigned for the Cortex-M33 */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_20_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO1_20_FUNC_ALT1 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_28_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO1_28_FUNC_ALT1 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_29_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO1_29_FUNC_ALT1 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_30_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO1_30_FUNC_ALT1 0x01u

/*! @name FC7_RTS_SCL_SSEL1 (number 4), U12[4]/U13[2]/J8[5]/J9[2]/FC4_I2C_SCL
  @{ */
/* @} */

/*!
 * @brief Route 3 SPI pins: MOSI(d_out), MISO(d_in), SCK(clock).
 *
 */
void BOARD_InitExtMEMPins(void); /* Function assigned for the Cortex-M33 */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_22_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 7. */
#define PIO0_22_FUNC_ALT7 0x07u

/*! @name USB0_DM (number 98), J3[2]/FS_USB0_DN
  @{ */
/* @} */

/*! @name USB0_DP (number 97), J3[3]/FS_USB0_DP
  @{ */
/* @} */

/*! @name USB0_VBUS (number 78), USB0_VBUS
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSBPins(void); /* Function assigned for the Cortex-M33 */

#define PIO1_4_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_4_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO1_6_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_6_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO1_7_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_7_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO1_4 (number 1), Q5[G1]/J12[6]/ARD_LEDR_PWM
  @{ */

