ch7lin-cyber/myNXPs16_Prj/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_LED_ERR_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_ERR_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */
#define BOARD_INITLEDSPINS_LED_ERR_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_ERR_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_LED_ERR_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO1_6 (number 5), Q4[G1]/J12[10]/ARD_LEDB_PWM
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_LED_COM_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_COM_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
#define BOARD_INITLEDSPINS_LED_COM_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_COM_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_LED_COM_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO1_7 (number 9), Q4[G2]/J12[8]/ARD_LEDG_PWM
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_LED_RUN_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_RUN_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define BOARD_INITLEDSPINS_LED_RUN_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_RUN_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_LED_RUN_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Route default RGB pins.
 *
 */
void BOARD_InitLEDsPins(void); /* Function assigned for the Cortex-M33 */

#define PIO1_1_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_1_FUNC_ALT5 0x05u        /*!<@brief Selects pin function.: Alternative connection 5. */
#define PIO1_2_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_2_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO1_3_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_3_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */

/*!
 * @brief Route 8 GPIO input pins.
 *
 */
void BOARD_InitDipSWPins(void); /* Function assigned for the Cortex-M33 */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_17_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_17_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_1_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_1_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_13_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_13_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_18_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_18_FUNC_ALT0 0x00u

/*! @name PIO1_13 (number 2), J18[2]/J9[19]/FC6_I2S_RX
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITROTARYSWPINS_RR_SW_1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITROTARYSWPINS_RR_SW_1_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */
#define BOARD_INITROTARYSWPINS_RR_SW_1_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITROTARYSWPINS_RR_SW_1_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITROTARYSWPINS_RR_SW_1_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO0_1 (number 7), J11[3]/J12[1]/EXP_CMP0_OUT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITROTARYSWPINS_RR_SW_4_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITROTARYSWPINS_RR_SW_4_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */
#define BOARD_INITROTARYSWPINS_RR_SW_4_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITROTARYSWPINS_RR_SW_4_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITROTARYSWPINS_RR_SW_4_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PIO0_17 (number 8), J25/P0_17
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITROTARYSWPINS_RR_SW_8_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITROTARYSWPINS_RR_SW_8_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */
#define BOARD_INITROTARYSWPINS_RR_SW_8_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITROTARYSWPINS_RR_SW_8_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITROTARYSWPINS_RR_SW_8_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO1_18 (number 64), SW1/J8[2]/J12[15]/MIK_EXP_BTN_WK
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITROTARYSWPINS_RR_SW_2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITROTARYSWPINS_RR_SW_2_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */
#define BOARD_INITROTARYSWPINS_RR_SW_2_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITROTARYSWPINS_RR_SW_2_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITROTARYSWPINS_RR_SW_2_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*!
 * @brief Route 4 GPIO input pins.
 *
 */
void BOARD_InitRotarySWPins(void); /* Function assigned for the Cortex-M33 */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_31_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_31_FUNC_ALT0 0x00u

/*! @name PIO1_31 (number 91), J13[7]/J13[8]/U13[28]/I2S_MCLK
  @{ */

