ch7lin-cyber/myNXPs16_Prj/board/pin_mux.h
/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITINTERBUSPINS_GPIO_1_InterBus_ENB_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITINTERBUSPINS_GPIO_1_InterBus_ENB_GPIO_PIN_MASK (1U << 5U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITINTERBUSPINS_GPIO_1_InterBus_ENB_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITINTERBUSPINS_GPIO_1_InterBus_ENB_PIN 5U
/*!
 * @brief PORT pin mask */
#define BOARD_INITINTERBUSPINS_GPIO_1_InterBus_ENB_PIN_MASK (1U << 5U)
/* @} */

/*! @name PIO1_10 (number 40), J12[4]/ARD_P1_10
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITINTERBUSPINS_GPIO_1_2_InterBus_PreENB_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITINTERBUSPINS_GPIO_1_2_InterBus_PreENB_GPIO_PIN_MASK (1U << 10U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITINTERBUSPINS_GPIO_1_2_InterBus_PreENB_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITINTERBUSPINS_GPIO_1_2_InterBus_PreENB_PIN 10U
/*!
 * @brief PORT pin mask */
#define BOARD_INITINTERBUSPINS_GPIO_1_2_InterBus_PreENB_PIN_MASK (1U << 10U)
/* @} */

/*! @name PIO1_23 (number 42), J4[4]/U8[3]/J12[7]/HS_USB1_ID
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITINTERBUSPINS_GPIO_4_InterBus_FB_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITINTERBUSPINS_GPIO_4_InterBus_FB_GPIO_PIN_MASK (1U << 23U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITINTERBUSPINS_GPIO_4_InterBus_FB_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITINTERBUSPINS_GPIO_4_InterBus_FB_PIN 23U
/*!
 * @brief PORT pin mask */
#define BOARD_INITINTERBUSPINS_GPIO_4_InterBus_FB_PIN_MASK (1U << 23U)
/* @} */

/*! @name PIO1_14 (number 57), J12[3]/EXP_P1_14
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITINTERBUSPINS_GPIO_0_2_InterBus_PreENA_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITINTERBUSPINS_GPIO_0_2_InterBus_PreENA_GPIO_PIN_MASK (1U << 14U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITINTERBUSPINS_GPIO_0_2_InterBus_PreENA_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITINTERBUSPINS_GPIO_0_2_InterBus_PreENA_PIN 14U
/*!
 * @brief PORT pin mask */
#define BOARD_INITINTERBUSPINS_GPIO_0_2_InterBus_PreENA_PIN_MASK (1U << 14U)
/* @} */

/*! @name PIO1_21 (number 30), U12[6]/U13[3]/J8[6]/J9[4]/FC4_I2C_SDA
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITINTERBUSPINS_GPIO_0_InterBus_ENA_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITINTERBUSPINS_GPIO_0_InterBus_ENA_GPIO_PIN_MASK (1U << 21U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITINTERBUSPINS_GPIO_0_InterBus_ENA_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITINTERBUSPINS_GPIO_0_InterBus_ENA_PIN 21U
/*!
 * @brief PORT pin mask */
#define BOARD_INITINTERBUSPINS_GPIO_0_InterBus_ENA_PIN_MASK (1U << 21U)
/* @} */

/*! @name PIO1_17 (number 43), J12[20]/J13[2]/EXP_P1_17
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITINTERBUSPINS_GPIO_3_InterBus_CLK_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITINTERBUSPINS_GPIO_3_InterBus_CLK_GPIO_PIN_MASK (1U << 17U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITINTERBUSPINS_GPIO_3_InterBus_CLK_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITINTERBUSPINS_GPIO_3_InterBus_CLK_PIN 17U
/*!
 * @brief PORT pin mask */
#define BOARD_INITINTERBUSPINS_GPIO_3_InterBus_CLK_PIN_MASK (1U << 17U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitInterBusPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
